Catalogs/ПараметрыПолученияЗаявокНаCallBack.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ПараметрыПолученияЗаявокНаCallBack</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Clear</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьЗаТекущийДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключенCQ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CQ_auth_token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CQ_AppID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПараметрыПолученияЗаявокНаCallBack/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ОбъектНедвижимостиПриИзмененииНаСервере()
	Объект.ВидНедвижимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектНедвижимости, "ВидНедвижимости");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектНедвижимостиПриИзменении(Элемент)
	ОбъектНедвижимостиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ЗаДату.Доступность = НЕ Объект.ЗагружатьЗаТекущийДень;
	Элементы.ГруппаCQ.Видимость = Объект.ПодключенCQ;
	
КонецПроцедуры

&НаСервере
Процедура ЗагружатьЗаТекущийДеньПриИзмененииНаСервере()
	
	Элементы.ЗаДату.Доступность = НЕ Объект.ЗагружатьЗаТекущийДень;
	Объект.ЗаДату = ?(Объект.ЗагружатьЗаТекущийДень, Дата(1,1,1), ТекущаяДата());

КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьЗаТекущийДеньПриИзменении(Элемент)
	ЗагружатьЗаТекущийДеньПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПодключенCQПриИзменении(Элемент)
	Элементы.ГруппаCQ.Видимость = Объект.ПодключенCQ;
КонецПроцедуры
